# Imports

In [2]:
import pandas as pd
import numpy as np
import boto3
import configparser
import psycopg2
from faker import Faker

## Conección

In [12]:
config = configparser.ConfigParser()
config.read('config.cfg')

['config.cfg']

In [13]:
aws_rds_conn = boto3.client('rds', aws_access_key_id=config.get('IAM', 'ACCESS_KEY'), 
                            aws_secret_access_key = config.get('IAM', 'SECRET_KEY'), region_name='us-east-2')

In [14]:
try: 
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('HECHOS','DB_INSTANCE_ID'))
    RDS_HOSTNAME = instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
except Exception as ex:
    print('Error!!!',ex)

hechosdbproject.ctiwauocyj1r.us-east-2.rds.amazonaws.com

In [15]:
driver = f"""mysql://{config.get('HECHOS', 'DB_USERNAME')}:{config.get('HECHOS', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('HECHOS', 'DB_PORT')}/{config.get('HECHOS', 'DB_NAME')}"""
driver

'mysql://adminpostgres:pUqUKYliiOJx958Y5m3KF9Sis@hechosdbproject.ctiwauocyj1r.us-east-2.rds.amazonaws.com:3306/hechos'

In [16]:
def insertData2SQL(df, table_name, driver):
    try:
        response = df.to_sql(table_name, driver, index=False, if_exists='append')
        print(f'Se han insertado {response} nuevos registros')
    except Exception as ex:
        print('Error!!!', ex)

In [17]:
postgres_driver = 'postgresql://ecomercedb:xi0iCRebLPEraW6f9C8U@ecomercedb.ctiwauocyj1r.us-east-2.rds.amazonaws.com:5432/ecomerce'
postgres_driver

'postgresql://ecomercedb:xi0iCRebLPEraW6f9C8U@ecomercedb.ctiwauocyj1r.us-east-2.rds.amazonaws.com:5432/ecomerce'

## Dimencion Articulo

In [11]:
sql_query = "select * from articulo"
df_articulo = pd.read_sql(sql_query, postgres_driver)
df_articulo.head()

,idarticulo,idcategoria,codigo,nombre,precio_venta,stock,descripcion,imagen,estado
0,1,1,FURN1,Elegant Office Desk,299.99,2280,A stylish and functional desk for your office.,,True
1,2,1,FURN2,Leather Sofa,799.99,1900,A comfortable leather sofa for your living room.,,True
2,3,1,FURN3,Wooden Dining Table,499.99,2128,A beautiful wooden dining table for your home.,,True
3,4,1,FURN4,Executive Chair,199.99,2432,An ergonomic chair for your office.,,True
4,5,1,FURN5,Bookshelf,149.99,1976,A sturdy bookshelf to organize your books.,,True

In [12]:
sql_query = "select * from categoria"
df_categoria = pd.read_sql(sql_query, postgres_driver)
df_categoria.head()

,idcategoria,nombre,descripcion,estado
0,1,Furniture,productos como muebles para oficina y casa,True
1,2,Toy,conjunto de productos para diversion,True
2,3,Health,productos utilizados para la salud,True
3,4,Car,productos para vehiculos,True
4,5,Electronics,productos electronicos de todo tipo,True

In [17]:
df_categoria_articulo = df_articulo.merge(df_categoria, on = 'idcategoria', how = 'inner')
df_categoria_articulo.head()

,idarticulo,idcategoria,codigo,nombre_x,precio_venta,stock,descripcion_x,imagen,estado_x,nombre_y,descripcion_y,estado_y
0,1,1,FURN1,Elegant Office Desk,299.99,2280,A stylish and functional desk for your office.,,True,Furniture,productos como muebles para oficina y casa,True
1,2,1,FURN2,Leather Sofa,799.99,1900,A comfortable leather sofa for your living room.,,True,Furniture,productos como muebles para oficina y casa,True
2,3,1,FURN3,Wooden Dining Table,499.99,2128,A beautiful wooden dining table for your home.,,True,Furniture,productos como muebles para oficina y casa,True
3,4,1,FURN4,Executive Chair,199.99,2432,An ergonomic chair for your office.,,True,Furniture,productos como muebles para oficina y casa,True
4,5,1,FURN5,Bookshelf,149.99,1976,A sturdy bookshelf to organize your books.,,True,Furniture,productos como muebles para oficina y casa,True

In [18]:
df_categoria_articulo.drop(['idcategoria', 'descripcion_x', 'descripcion_y', 'imagen', 'estado_y', 'estado_x'], axis=1, inplace=True)
df_categoria_articulo.head()

   idarticulo codigo             nombre_x  precio_venta  stock   nombre_y
0           1  FURN1  Elegant Office Desk        299.99   2280  Furniture
1           2  FURN2         Leather Sofa        799.99   1900  Furniture
2           3  FURN3  Wooden Dining Table        499.99   2128  Furniture
3           4  FURN4      Executive Chair        199.99   2432  Furniture
4           5  FURN5            Bookshelf        149.99   1976  Furniture

In [19]:
nombres_nuevos = {
    'nombre_x': 'nombre',
    'nombre_y': 'nombre_categoria'
}

df_categoria_articulo.rename(columns=nombres_nuevos, inplace=True)
df_categoria_articulo.head()

,idarticulo,codigo,nombre,precio_venta,stock,nombre_categoria
0,1,FURN1,Elegant Office Desk,299.99,2280,Furniture
1,2,FURN2,Leather Sofa,799.99,1900,Furniture
2,3,FURN3,Wooden Dining Table,499.99,2128,Furniture
3,4,FURN4,Executive Chair,199.99,2432,Furniture
4,5,FURN5,Bookshelf,149.99,1976,Furniture

In [22]:
insertData2SQL(df_categoria_articulo, 'dim_Articulo', driver)

Se han insertado None nuevos registros

## Dimension Persona

In [25]:
sql_query = "select * from persona"
df_persona = pd.read_sql(sql_query, postgres_driver)
df_persona.head()

,idpersona,tipo_persona,nombre,tipo_documento,num_documento,direccion,telefono,email
0,1,HOMBRE,Keith Sanchez,DNI,81698334937904490,"6586 Fields Rest Apt. 523\nLake Lukeberg, CT 9...",433-3761249,oowen@example.org
1,2,MUJER,Caitlin White,Pasaporte,68998464915473773,"4118 Lauren Place\nJohnsonview, MP 77537",508-6620328,elizabethmoran@example.org
2,3,HOMBRE,Taylor Ayala,Pasaporte,50587755093236224,"8999 Guzman Springs\nColemanborough, AS 85893",452-8843838,monicaholloway@example.net
3,4,HOMBRE,Thomas Hoover,Pasaporte,22135971649662819,"97981 Wolfe Station\nSolomonton, FM 89663",763-6251271,fgill@example.org
4,5,MUJER,Kristina Glass,DNI,83245230508524570,USS Smith\nFPO AE 53747,597-6062618,jenniferanderson@example.net

In [26]:
insertData2SQL(df_persona, 'dim_Persona', driver)

Se han insertado None nuevos registros

## Dimension Usuario

In [21]:
sql_query = "select * from usuario"
df_usuario = pd.read_sql(sql_query, postgres_driver)
df_usuario.head()

,idusuario,idrol,nombre,tipo_documento,num_documento,direccion,telefono,email,clave,estado
0,1,3,Ronald Durham,Pasaporte,21685653206775647,"35394 Brown Mall Apt. 352\nAmyburgh, IL 54664",00000000000000000000,davisshelly@example.net,"[b'\xc0', b'\xc7', b'\xfe', b'\x02', b'\x15', ...",False
1,2,1,Gregory Burch,Pasaporte,69210999840545495,"53023 Nicole Drive\nWest Jessica, DC 82681",00000000000000000000,oelliott@example.org,"[b'\xc3', b'\xe0', b'\x03', b'\xcb', b'r', b'\...",True
2,3,1,Eric Meadows,DPI,32647310368536862,USCGC Gonzalez\nFPO AE 11951,00000000000000000000,vsmith@example.com,"[b'\xdb', b'%', b'#', b'\xbe', b'j', b'\xed', ...",True
3,4,4,Scott Cox,DPI,65851574830601831,"42400 Ray Squares\nAaronfort, SD 46987",00000000000000000000,michaeljohnson@example.net,"[b'\x17', b'f', b'M', b'\xfe', b'7', b'\xf0', ...",True
4,5,3,Allison Koch,DPI,19599502954939346,"307 Eric Points\nWilliamsview, LA 18929",00000000000000000000,lanerobert@example.org,"[b'+', b'W', b'\xc7', b'F', b'\\', b'\xa7', b'...",False

In [22]:
sql_query = "select * from rol"
df_rol = pd.read_sql(sql_query, postgres_driver)
df_rol.head()

   idrol        nombre                                    descripcion  estado
0      1        Ventas  Departamento encargado de la comercialización    True
1      2  Contabilidad         Departamento encargado de las finanzas    True
2      3      Limpieza                Departamento encargado del aseo    True
3      4       Gerente                      Encargado de Departamento    True
4      5         Dueño                        Propietario del negocio    True

In [26]:
df_usuario_rol = df_usuario.merge(df_rol, on="idrol", how="inner")
df_usuario_rol.head()

,idusuario,idrol,nombre_x,tipo_documento,num_documento,direccion,telefono,email,clave,estado_x,nombre_y,descripcion,estado_y
0,1,3,Ronald Durham,Pasaporte,21685653206775647,"35394 Brown Mall Apt. 352\nAmyburgh, IL 54664",00000000000000000000,davisshelly@example.net,"[b'\xc0', b'\xc7', b'\xfe', b'\x02', b'\x15', ...",False,Limpieza,Departamento encargado del aseo,True
1,5,3,Allison Koch,DPI,19599502954939346,"307 Eric Points\nWilliamsview, LA 18929",00000000000000000000,lanerobert@example.org,"[b'+', b'W', b'\xc7', b'F', b'\\', b'\xa7', b'...",False,Limpieza,Departamento encargado del aseo,True
2,2,1,Gregory Burch,Pasaporte,69210999840545495,"53023 Nicole Drive\nWest Jessica, DC 82681",00000000000000000000,oelliott@example.org,"[b'\xc3', b'\xe0', b'\x03', b'\xcb', b'r', b'\...",True,Ventas,Departamento encargado de la comercialización,True
3,3,1,Eric Meadows,DPI,32647310368536862,USCGC Gonzalez\nFPO AE 11951,00000000000000000000,vsmith@example.com,"[b'\xdb', b'%', b'#', b'\xbe', b'j', b'\xed', ...",True,Ventas,Departamento encargado de la comercialización,True
4,6,1,Lauren Reese,Pasaporte,8016207275554064,USS Wright\nFPO AE 35647,00000000000000000000,olandry@example.com,"[b'\xcb', b'\x8f', b'\xf9', b'\xc5', b'\xfb', ...",True,Ventas,Departamento encargado de la comercialización,True

In [27]:
columnas_a_eliminar = ['direccion', 'telefono', 'email', 'clave', 'estado_y', 'descripcion']

df_usuario_rol = df_usuario_rol.drop(columnas_a_eliminar, axis=1)
df_usuario_rol.head()

,idusuario,idrol,nombre_x,tipo_documento,num_documento,estado_x,nombre_y
0,1,3,Ronald Durham,Pasaporte,21685653206775647,False,Limpieza
1,5,3,Allison Koch,DPI,19599502954939346,False,Limpieza
2,2,1,Gregory Burch,Pasaporte,69210999840545495,True,Ventas
3,3,1,Eric Meadows,DPI,32647310368536862,True,Ventas
4,6,1,Lauren Reese,Pasaporte,8016207275554064,True,Ventas

In [28]:
nuevos_nombres = {
    'nombre_x': 'nombre',
    'nombre_y': 'rol_nombre',
    'estado_x' : 'estado'
}

df_usuario_rol = df_usuario_rol.rename(columns=nuevos_nombres)
df_usuario_rol.head()

,idusuario,idrol,nombre,tipo_documento,num_documento,estado,rol_nombre
0,1,3,Ronald Durham,Pasaporte,21685653206775647,False,Limpieza
1,5,3,Allison Koch,DPI,19599502954939346,False,Limpieza
2,2,1,Gregory Burch,Pasaporte,69210999840545495,True,Ventas
3,3,1,Eric Meadows,DPI,32647310368536862,True,Ventas
4,6,1,Lauren Reese,Pasaporte,8016207275554064,True,Ventas

In [29]:
df_usuario_rol['estado'] = df_usuario_rol['estado'].map({True: 1, False: 0})
df_usuario_rol.head()

,idusuario,idrol,nombre,tipo_documento,num_documento,estado,rol_nombre
0,1,3,Ronald Durham,Pasaporte,21685653206775647,0,Limpieza
1,5,3,Allison Koch,DPI,19599502954939346,0,Limpieza
2,2,1,Gregory Burch,Pasaporte,69210999840545495,1,Ventas
3,3,1,Eric Meadows,DPI,32647310368536862,1,Ventas
4,6,1,Lauren Reese,Pasaporte,8016207275554064,1,Ventas

In [30]:
insertData2SQL(df_usuario_rol, 'dim_Usuario', driver)

Se han insertado 12 nuevos registros

## Dimension Tiempo

In [6]:
df_tiempo = pd.read_excel('CSV/fechas.xlsx')
df_tiempo

,date key,full date,day of week,day num in month,day name,weekday flag,week num in year,week begin date,month,month name,quarter,fiscal month,fiscal quarter,fiscal year,month end flag
0,20230301,2023-03-01,3,1,Wednesday,Weekday,10,2023-02-27,3,March,1,9,3,2023,Not Month End
1,20230302,2023-03-02,4,2,Thursday,Weekday,10,2023-02-27,3,March,1,9,3,2023,Not Month End
2,20230303,2023-03-03,5,3,Friday,Weekday,10,2023-02-27,3,March,1,9,3,2023,Not Month End
3,20230304,2023-03-04,6,4,Saturday,Weekend,10,2023-02-27,3,March,1,9,3,2023,Not Month End
4,20230305,2023-03-05,7,5,Sunday,Weekend,10,2023-02-27,3,March,1,9,3,2023,Not Month End
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
422,20240426,2024-04-26,5,26,Friday,Weekday,17,2024-04-22,4,April,2,10,4,2024,Not Month End
423,20240427,2024-04-27,6,27,Saturday,Weekend,17,2024-04-22,4,April,2,10,4,2024,Not Month End
424,20240428,2024-04-28,7,28,Sunday,Weekend,17,2024-04-22,4,April,2,10,4,2024,Not Month End
425,20240429,2024-04-29,1,29,Monday,Weekday,18,2024-04-29,4,April,2,10,4,2024,Not Month End
426,20240430,2024-04-30,2,30,Tuesday,Weekday,18,2024-04-29,4,April,2,10,4,2024,Month End

In [8]:
nombre_columnas = {
    'date key' : 'idfecha', 
    'full date' : 'fecha_completa',
    'day of week' : 'fecha_dia_semana',
    'day num in month' : 'fecha_dia_mes',
    'day name' : 'dia_nombre',
    'weekday flag' : 'semana_fin_bandera',
    'week num in year' : 'semana_ano',
    'week begin date' : 'dia_semana_inicio',
    'month' : 'mes',
    'month name' : 'mes_nombre',
    'quarter': 'cuarto',
    'fiscal month' : 'mes_fiscal',
    'fiscal quarter' : 'cuarto_fiscal',
    'fiscal year' : 'ano_fiscal',
    'month end flag' : 'mes_fin_bandera' }

df_tiempo = df_tiempo.rename(columns=nombre_columnas)
df_tiempo

,idfecha,fecha_completa,fecha_dia_semana,fecha_dia_mes,dia_nombre,semana_fin_bandera,semana_ano,dia_semana_inicio,mes,mes_nombre,cuarto,mes_fiscal,cuarto_fiscal,ano_fiscal,mes_fin_bandera
0,20230301,2023-03-01,3,1,Wednesday,Weekday,10,2023-02-27,3,March,1,9,3,2023,Not Month End
1,20230302,2023-03-02,4,2,Thursday,Weekday,10,2023-02-27,3,March,1,9,3,2023,Not Month End
2,20230303,2023-03-03,5,3,Friday,Weekday,10,2023-02-27,3,March,1,9,3,2023,Not Month End
3,20230304,2023-03-04,6,4,Saturday,Weekend,10,2023-02-27,3,March,1,9,3,2023,Not Month End
4,20230305,2023-03-05,7,5,Sunday,Weekend,10,2023-02-27,3,March,1,9,3,2023,Not Month End
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
422,20240426,2024-04-26,5,26,Friday,Weekday,17,2024-04-22,4,April,2,10,4,2024,Not Month End
423,20240427,2024-04-27,6,27,Saturday,Weekend,17,2024-04-22,4,April,2,10,4,2024,Not Month End
424,20240428,2024-04-28,7,28,Sunday,Weekend,17,2024-04-22,4,April,2,10,4,2024,Not Month End
425,20240429,2024-04-29,1,29,Monday,Weekday,18,2024-04-29,4,April,2,10,4,2024,Not Month End
426,20240430,2024-04-30,2,30,Tuesday,Weekday,18,2024-04-29,4,April,2,10,4,2024,Month End

In [49]:
insertData2SQL(df_tiempo, 'dim_Tiempo', driver)

Se han insertado 427 nuevos registros

## Dimension Ventas (Fact)

In [39]:
sql_query = "select * from venta"
df_venta = pd.read_sql(sql_query, postgres_driver)
df_venta.head()

,idventa,idcliente,idusuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado
0,1,1,2,Factura,A001,000001,2024-04-13 10:00:00,None,None,Pendiente
1,2,2,2,Factura,A001,000002,2024-04-13 10:01:00,None,None,Pendiente
2,3,3,2,Factura,A001,000003,2024-04-13 10:02:00,None,None,Pendiente
3,4,4,2,Factura,A001,000004,2024-04-13 10:03:00,None,None,Pendiente
4,5,5,2,Factura,A001,000005,2024-04-13 10:04:00,None,None,Pendiente

In [38]:
sql_query = "select * from detalle_venta"
df_dtventa = pd.read_sql(sql_query, postgres_driver)
df_dtventa.head()

   iddetalle_venta  idventa  idarticulo  cantidad  precio  descuento
0             1001        8          24         2  999.99        NaN
1             1002       80          19         3   14.99        NaN
2             1003        6           9         1   14.99        NaN
3             1004       86          19         3   14.99        NaN
4             1005       57           4         2  199.99        NaN

In [66]:
df_venta_detallev = df_dtventa.merge(df_venta, on = 'idventa', how='inner')
df_venta_detallev.head()

,iddetalle_venta,idventa,idarticulo,cantidad,precio,descuento,idcliente,idusuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado
0,1001,8,24,2,999.99,NaN,8,3,Factura,A001,000008,2024-04-13 10:07:00,None,None,Pendiente
1,1186,8,24,1,999.99,0.03,8,3,Factura,A001,000008,2024-04-13 10:07:00,None,None,Pendiente
2,1324,8,21,3,799.99,NaN,8,3,Factura,A001,000008,2024-04-13 10:07:00,None,None,Pendiente
3,1358,8,18,1,4.99,NaN,8,3,Factura,A001,000008,2024-04-13 10:07:00,None,None,Pendiente
4,1457,8,22,2,149.99,NaN,8,3,Factura,A001,000008,2024-04-13 10:07:00,None,None,Pendiente

In [67]:
columnas_a_eliminar = ['iddetalle_venta', 'total', 'impuesto', 'num_comprobante', 'serie_comprobante', 'tipo_comprobante', 'estado']

df_venta_detallev = df_venta_detallev.drop(columnas_a_eliminar, axis=1)
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idcliente,idusuario,fecha
0,8,24,2,999.99,NaN,8,3,2024-04-13 10:07:00
1,8,24,1,999.99,0.03,8,3,2024-04-13 10:07:00
2,8,21,3,799.99,NaN,8,3,2024-04-13 10:07:00
3,8,18,1,4.99,NaN,8,3,2024-04-13 10:07:00
4,8,22,2,149.99,NaN,8,3,2024-04-13 10:07:00

In [68]:
df_venta_detallev['descuento'] = df_venta_detallev['descuento'].fillna(0)
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idcliente,idusuario,fecha
0,8,24,2,999.99,0.00,8,3,2024-04-13 10:07:00
1,8,24,1,999.99,0.03,8,3,2024-04-13 10:07:00
2,8,21,3,799.99,0.00,8,3,2024-04-13 10:07:00
3,8,18,1,4.99,0.00,8,3,2024-04-13 10:07:00
4,8,22,2,149.99,0.00,8,3,2024-04-13 10:07:00

In [69]:
df_venta_detallev['total'] = df_venta_detallev.apply(lambda row:
                      row['cantidad'] * row['precio'] * (1-row['descuento']) if row['descuento'] != 0 else row['cantidad'] * row['precio'], axis=1)
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idcliente,idusuario,fecha,total
0,8,24,2,999.99,0.00,8,3,2024-04-13 10:07:00,1999.9800
1,8,24,1,999.99,0.03,8,3,2024-04-13 10:07:00,969.9903
2,8,21,3,799.99,0.00,8,3,2024-04-13 10:07:00,2399.9700
3,8,18,1,4.99,0.00,8,3,2024-04-13 10:07:00,4.9900
4,8,22,2,149.99,0.00,8,3,2024-04-13 10:07:00,299.9800

In [70]:
df_venta_detallev['impuesto'] = df_venta_detallev['total'] * 0.12
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idcliente,idusuario,fecha,total,impuesto
0,8,24,2,999.99,0.00,8,3,2024-04-13 10:07:00,1999.9800,239.997600
1,8,24,1,999.99,0.03,8,3,2024-04-13 10:07:00,969.9903,116.398836
2,8,21,3,799.99,0.00,8,3,2024-04-13 10:07:00,2399.9700,287.996400
3,8,18,1,4.99,0.00,8,3,2024-04-13 10:07:00,4.9900,0.598800
4,8,22,2,149.99,0.00,8,3,2024-04-13 10:07:00,299.9800,35.997600

In [71]:
df_venta_detallev = df_venta_detallev.rename(columns={'idcliente' : 'idpersona'})
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idpersona,idusuario,fecha,total,impuesto
0,8,24,2,999.99,0.00,8,3,2024-04-13 10:07:00,1999.9800,239.997600
1,8,24,1,999.99,0.03,8,3,2024-04-13 10:07:00,969.9903,116.398836
2,8,21,3,799.99,0.00,8,3,2024-04-13 10:07:00,2399.9700,287.996400
3,8,18,1,4.99,0.00,8,3,2024-04-13 10:07:00,4.9900,0.598800
4,8,22,2,149.99,0.00,8,3,2024-04-13 10:07:00,299.9800,35.997600

In [72]:
tipos_datos = df_venta_detallev.dtypes

# Imprimir los tipos de datos de las columnas
print(tipos_datos)

idventa                int64
idarticulo             int64
cantidad               int64
precio               float64
descuento            float64
idpersona              int64
idusuario              int64
fecha         datetime64[ns]
total                float64
impuesto             float64
dtype: object

In [73]:
# Convertir la columna "fecha" al tipo datetime si no está en ese formato
df_venta_detallev['fecha'] = pd.to_datetime(df_venta_detallev['fecha'])

# Eliminar la información de tiempo
df_venta_detallev['fecha'] = df_venta_detallev['fecha'].dt.date

# Convertir la columna "fecha" a entero en el formato "YYYYMMDD"
df_venta_detallev['fecha'] = df_venta_detallev['fecha'].astype(str).str.replace('-', '').astype(int)
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idpersona,idusuario,fecha,total,impuesto
0,8,24,2,999.99,0.00,8,3,20240413,1999.9800,239.997600
1,8,24,1,999.99,0.03,8,3,20240413,969.9903,116.398836
2,8,21,3,799.99,0.00,8,3,20240413,2399.9700,287.996400
3,8,18,1,4.99,0.00,8,3,20240413,4.9900,0.598800
4,8,22,2,149.99,0.00,8,3,20240413,299.9800,35.997600

In [74]:
df_venta_detallev = df_venta_detallev.rename(columns={'fecha' : 'idfecha'})
df_venta_detallev.head()

,idventa,idarticulo,cantidad,precio,descuento,idpersona,idusuario,idfecha,total,impuesto
0,8,24,2,999.99,0.00,8,3,20240413,1999.9800,239.997600
1,8,24,1,999.99,0.03,8,3,20240413,969.9903,116.398836
2,8,21,3,799.99,0.00,8,3,20240413,2399.9700,287.996400
3,8,18,1,4.99,0.00,8,3,20240413,4.9900,0.598800
4,8,22,2,149.99,0.00,8,3,20240413,299.9800,35.997600

In [76]:
insertData2SQL(df_venta_detallev, 'fact_Ventas', driver)

Se han insertado 2000 nuevos registros